# Pandas

- Analyse 2D or multi dimensional data
- Table like data
- Internally they use numpy
-

In [4]:
import pandas as pd

In [5]:

data = {
    "Name": ["John", "Anna", "Peter", "Linda"],
    "Age": [28, 34, 29, 32],
    "City": ["New York", "Paris", "Berlin", "London"],
}

data

{'Name': ['John', 'Anna', 'Peter', 'Linda'],
 'Age': [28, 34, 29, 32],
 'City': ['New York', 'Paris', 'Berlin', 'London']}

## Creating DataFrame

In [6]:
df = pd.DataFrame(data)

df

    Name  Age      City
0   John   28  New York
1   Anna   34     Paris
2  Peter   29    Berlin
3  Linda   32    London

## Filtering columns

- Select Name from df

In [7]:
df["Name"]

0     John
1     Anna
2    Peter
3    Linda
Name: Name, dtype: object

## First two rows
Select * 
From df 
Limit 2

In [8]:
df.head(2)

   Name  Age      City
0  John   28  New York
1  Anna   34     Paris

In [9]:
df.head()

    Name  Age      City
0   John   28  New York
1   Anna   34     Paris
2  Peter   29    Berlin
3  Linda   32    London

In [10]:
import numpy as np

In [11]:
items = np.array(
    [
        " Apple",
        "banana ",
        "GRAPE",
        "cucumber",
        "Pineapple",
        " tomato ",
        "Orange",
        "Orange",
        " lemon",
        "Kiwi ",
        "mango",
        "blueberry ",
        " raspberry",
    ]
)

print(type(items))
print(type(items[0]))

<class 'numpy.ndarray'>
<class 'numpy.str_'>

In [12]:
hourly_visitors = np.array([468, 279, 73, 272, 406, 128, 302, 216, 140, 82])

print(type(hourly_visitors))
print(type(hourly_visitors[0]))

<class 'numpy.ndarray'>
<class 'numpy.int64'>

## Info about data
- Columns
- Datatype
- Space occupied
- Null
- Fell for the data

In [13]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    4 non-null      object
 1   Age     4 non-null      int64
 2   City    4 non-null      object
dtypes: int64(1), object(2)
memory usage: 228.0+ bytes

In [14]:
df

    Name  Age      City
0   John   28  New York
1   Anna   34     Paris
2  Peter   29    Berlin
3  Linda   32    London

In [15]:
df.shape  # (rows, columns)

(4, 3)

In [16]:
df.dtypes  # DataType

Name    object
Age      int64
City    object
dtype: object

In [17]:
df.columns

Index(['Name', 'Age', 'City'], dtype='object')

In [18]:
df.describe()

             Age
count   4.000000
mean   30.750000
std     2.753785
min    28.000000
25%    28.750000
50%    30.500000
75%    32.500000
max    34.000000

In [19]:
df.describe(include="all") # Force all the columns

        Name        Age      City
count      4   4.000000         4
unique     4        NaN         4
top     John        NaN  New York
freq       1        NaN         1
mean     NaN  30.750000       NaN
std      NaN   2.753785       NaN
min      NaN  28.000000       NaN
25%      NaN  28.750000       NaN
50%      NaN  30.500000       NaN
75%      NaN  32.500000       NaN
max      NaN  34.000000       NaN

In [20]:
people_df = df.describe(include="all")

people_df["City"]

count            4
unique           4
top       New York
freq             1
mean           NaN
std            NaN
min            NaN
25%            NaN
50%            NaN
75%            NaN
max            NaN
Name: City, dtype: object

In [21]:
tips_df = pd.read_csv("./tips.csv")

In [22]:
tips_df

     total_bill   tip     sex smoker   day    time  size
0         16.99  1.01  Female     No   Sun  Dinner     2
1         10.34  1.66    Male     No   Sun  Dinner     3
2         21.01  3.50    Male     No   Sun  Dinner     3
3         23.68  3.31    Male     No   Sun  Dinner     2
4         24.59  3.61  Female     No   Sun  Dinner     4
..          ...   ...     ...    ...   ...     ...   ...
239       29.03  5.92    Male     No   Sat  Dinner     3
240       27.18  2.00  Female    Yes   Sat  Dinner     2
241       22.67  2.00    Male    Yes   Sat  Dinner     2
242       17.82  1.75    Male     No   Sat  Dinner     2
243       18.78  3.00  Female     No  Thur  Dinner     2

[244 rows x 7 columns]

In [23]:
tips_df[0:5]
tips_df.head(5) # Preferred way

   total_bill   tip     sex smoker  day    time  size
0       16.99  1.01  Female     No  Sun  Dinner     2
1       10.34  1.66    Male     No  Sun  Dinner     3
2       21.01  3.50    Male     No  Sun  Dinner     3
3       23.68  3.31    Male     No  Sun  Dinner     2
4       24.59  3.61  Female     No  Sun  Dinner     4

In [24]:
tips_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 244 entries, 0 to 243
Data columns (total 7 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   total_bill  244 non-null    float64
 1   tip         244 non-null    float64
 2   sex         244 non-null    object
 3   smoker      244 non-null    object
 4   day         244 non-null    object
 5   time        244 non-null    object
 6   size        244 non-null    int64
dtypes: float64(2), int64(1), object(4)
memory usage: 13.5+ KB

In [25]:
tips_df.describe()

       total_bill         tip        size
count  244.000000  244.000000  244.000000
mean    19.785943    2.998279    2.569672
std      8.902412    1.383638    0.951100
min      3.070000    1.000000    1.000000
25%     13.347500    2.000000    2.000000
50%     17.795000    2.900000    2.000000
75%     24.127500    3.562500    3.000000
max     50.810000   10.000000    6.000000

## SELECT day, time, tip FROM tips_df

In [26]:
tips_df[['day', 'time', 'tip']]

      day    time   tip
0     Sun  Dinner  1.01
1     Sun  Dinner  1.66
2     Sun  Dinner  3.50
3     Sun  Dinner  3.31
4     Sun  Dinner  3.61
..    ...     ...   ...
239   Sat  Dinner  5.92
240   Sat  Dinner  2.00
241   Sat  Dinner  2.00
242   Sat  Dinner  1.75
243  Thur  Dinner  3.00

[244 rows x 3 columns]

In [27]:
tips_df[["day", "time", "tip"]].head(10)

   day    time   tip
0  Sun  Dinner  1.01
1  Sun  Dinner  1.66
2  Sun  Dinner  3.50
3  Sun  Dinner  3.31
4  Sun  Dinner  3.61
5  Sun  Dinner  4.71
6  Sun  Dinner  2.00
7  Sun  Dinner  3.12
8  Sun  Dinner  1.96
9  Sun  Dinner  3.23

# Find the how much percentage people are tiping
 
- Find tip percentage
- Add it as another column - tip_percent
- Round off to 2 decimal
- `20.34` not be `0.243`

In [28]:


# Assuming tips_df is already loaded
tips_df["tip_percent"] = (tips_df["tip"] / tips_df["total_bill"]) * 100

# Round off to 2 decimal places
tips_df["tip_percent"] = tips_df["tip_percent"].round(2)

# Display the updated DataFrame
tips_df.head()

   total_bill   tip     sex smoker  day    time  size  tip_percent
0       16.99  1.01  Female     No  Sun  Dinner     2         5.94
1       10.34  1.66    Male     No  Sun  Dinner     3        16.05
2       21.01  3.50    Male     No  Sun  Dinner     3        16.66
3       23.68  3.31    Male     No  Sun  Dinner     2        13.98
4       24.59  3.61  Female     No  Sun  Dinner     4        14.68

## Task 1
- Filter the rows where people dined on a Sunday
- Clue: Boolean matrix

In [29]:
tips_df.sort_values(by="tip_percent", ascending=False).head(5)
tips_df.sort_values(by="total_bill", ascending=False).head(5)

     total_bill    tip   sex smoker  day    time  size  tip_percent
170       50.81  10.00  Male    Yes  Sat  Dinner     3        19.68
212       48.33   9.00  Male     No  Sat  Dinner     4        18.62
59        48.27   6.73  Male     No  Sat  Dinner     4        13.94
156       48.17   5.00  Male     No  Sun  Dinner     6        10.38
182       45.35   3.50  Male    Yes  Sun  Dinner     3         7.72

In [30]:
tips_df[tips_df["day"] == "Sun"]

     total_bill   tip     sex smoker  day    time  size  tip_percent
0         16.99  1.01  Female     No  Sun  Dinner     2         5.94
1         10.34  1.66    Male     No  Sun  Dinner     3        16.05
2         21.01  3.50    Male     No  Sun  Dinner     3        16.66
3         23.68  3.31    Male     No  Sun  Dinner     2        13.98
4         24.59  3.61  Female     No  Sun  Dinner     4        14.68
..          ...   ...     ...    ...  ...     ...   ...          ...
186       20.90  3.50  Female    Yes  Sun  Dinner     3        16.75
187       30.46  2.00    Male    Yes  Sun  Dinner     5         6.57
188       18.15  3.50  Female    Yes  Sun  Dinner     3        19.28
189       23.10  4.00    Male    Yes  Sun  Dinner     3        17.32
190       15.69  1.50    Male    Yes  Sun  Dinner     2         9.56

[76 rows x 8 columns]

## Task 2
Get the rows where person have tipped more than R3 on a Friday

In [31]:
tips_gt_3 = tips_df[tips_df["tip"] > 3]

tips_gt_3[tips_gt_3["day"] == "Fri"]


# & -> and | -> or
# Binary &, |

     total_bill   tip     sex smoker  day    time  size  tip_percent
91        22.49  3.50    Male     No  Fri  Dinner     2        15.56
93        16.32  4.30  Female    Yes  Fri  Dinner     2        26.35
94        22.75  3.25  Female     No  Fri  Dinner     2        14.29
95        40.17  4.73    Male    Yes  Fri  Dinner     4        11.77
96        27.28  4.00    Male    Yes  Fri  Dinner     2        14.66
221       13.42  3.48  Female    Yes  Fri   Lunch     2        25.93

In [32]:
tips_df[(tips_df["tip"] > 3) & (tips_df["day"] == "Fri")]

     total_bill   tip     sex smoker  day    time  size  tip_percent
91        22.49  3.50    Male     No  Fri  Dinner     2        15.56
93        16.32  4.30  Female    Yes  Fri  Dinner     2        26.35
94        22.75  3.25  Female     No  Fri  Dinner     2        14.29
95        40.17  4.73    Male    Yes  Fri  Dinner     4        11.77
96        27.28  4.00    Male    Yes  Fri  Dinner     2        14.66
221       13.42  3.48  Female    Yes  Fri   Lunch     2        25.93

In [33]:
tips_df[(tips_df["day"] == "Sun") | (tips_df["day"] == "Fri")]

     total_bill   tip     sex smoker  day    time  size  tip_percent
0         16.99  1.01  Female     No  Sun  Dinner     2         5.94
1         10.34  1.66    Male     No  Sun  Dinner     3        16.05
2         21.01  3.50    Male     No  Sun  Dinner     3        16.66
3         23.68  3.31    Male     No  Sun  Dinner     2        13.98
4         24.59  3.61  Female     No  Sun  Dinner     4        14.68
..          ...   ...     ...    ...  ...     ...   ...          ...
222        8.58  1.92    Male    Yes  Fri   Lunch     1        22.38
223       15.98  3.00  Female     No  Fri   Lunch     3        18.77
224       13.42  1.58    Male    Yes  Fri   Lunch     2        11.77
225       16.27  2.50  Female    Yes  Fri   Lunch     2        15.37
226       10.09  2.00  Female    Yes  Fri   Lunch     2        19.82

[95 rows x 8 columns]

## Task 3
Extended task 2 top 5 tips on that Friday

In [34]:
# & -> and | -> or

tips_gt_3_fri = tips_df[(tips_df["tip"] > 3) & (tips_df["day"] == "Fri")]

tips_gt_3_fri.sort_values(by="tip", ascending=False).head(5)

     total_bill   tip     sex smoker  day    time  size  tip_percent
95        40.17  4.73    Male    Yes  Fri  Dinner     4        11.77
93        16.32  4.30  Female    Yes  Fri  Dinner     2        26.35
96        27.28  4.00    Male    Yes  Fri  Dinner     2        14.66
91        22.49  3.50    Male     No  Fri  Dinner     2        15.56
221       13.42  3.48  Female    Yes  Fri   Lunch     2        25.93

## Task 4
Rows where - Large parties: people are 5 or more or they spend R35 or more

In [35]:
tips_df[(tips_df["size"] >= 5) | (tips_df["total_bill"] >= 35)]

     total_bill    tip     sex smoker   day    time  size  tip_percent
11        35.26   5.00  Female     No   Sun  Dinner     4        14.18
23        39.42   7.58    Male     No   Sat  Dinner     4        19.23
56        38.01   3.00    Male    Yes   Sat  Dinner     4         7.89
59        48.27   6.73    Male     No   Sat  Dinner     4        13.94
95        40.17   4.73    Male    Yes   Fri  Dinner     4        11.77
102       44.30   2.50  Female    Yes   Sat  Dinner     3         5.64
112       38.07   4.00    Male     No   Sun  Dinner     3        10.51
125       29.80   4.20  Female     No  Thur   Lunch     6        14.09
141       34.30   6.70    Male     No  Thur   Lunch     6        19.53
142       41.19   5.00    Male     No  Thur   Lunch     5        12.14
143       27.05   5.00  Female     No  Thur   Lunch     6        18.48
155       29.85   5.14  Female     No   Sun  Dinner     5        17.22
156       48.17   5.00    Male     No   Sun  Dinner     6        10.38
170       50.81  10.00    Male    Yes   Sat  Dinner     3        19.68
182       45.35   3.50    Male    Yes   Sun  Dinner     3         7.72
184       40.55   3.00    Male    Yes   Sun  Dinner     2         7.40
185       20.69   5.00    Male     No   Sun  Dinner     5        24.17
187       30.46   2.00    Male    Yes   Sun  Dinner     5         6.57
197       43.11   5.00  Female    Yes  Thur   Lunch     4        11.60
207       38.73   3.00    Male    Yes   Sat  Dinner     4         7.75
212       48.33   9.00    Male     No   Sat  Dinner     4        18.62
216       28.15   3.00    Male    Yes   Sat  Dinner     5        10.66
238       35.83   4.67  Female     No   Sat  Dinner     3        13.03

## Slicing
loc - name
iloc - index
head
tail

In [36]:
tips_df.tail()

     total_bill   tip     sex smoker   day    time  size  tip_percent
239       29.03  5.92    Male     No   Sat  Dinner     3        20.39
240       27.18  2.00  Female    Yes   Sat  Dinner     2         7.36
241       22.67  2.00    Male    Yes   Sat  Dinner     2         8.82
242       17.82  1.75    Male     No   Sat  Dinner     2         9.82
243       18.78  3.00  Female     No  Thur  Dinner     2        15.97

In [37]:
tips_df.head()

   total_bill   tip     sex smoker  day    time  size  tip_percent
0       16.99  1.01  Female     No  Sun  Dinner     2         5.94
1       10.34  1.66    Male     No  Sun  Dinner     3        16.05
2       21.01  3.50    Male     No  Sun  Dinner     3        16.66
3       23.68  3.31    Male     No  Sun  Dinner     2        13.98
4       24.59  3.61  Female     No  Sun  Dinner     4        14.68

In [38]:
tips_df.iloc[3]  # row

total_bill      23.68
tip              3.31
sex              Male
smoker             No
day               Sun
time           Dinner
size                2
tip_percent     13.98
Name: 3, dtype: object

In [39]:
tips_df.iloc[3:5]  # slice of row

   total_bill   tip     sex smoker  day    time  size  tip_percent
3       23.68  3.31    Male     No  Sun  Dinner     2        13.98
4       24.59  3.61  Female     No  Sun  Dinner     4        14.68

In [40]:
tips_df.loc[3]

total_bill      23.68
tip              3.31
sex              Male
smoker             No
day               Sun
time           Dinner
size                2
tip_percent     13.98
Name: 3, dtype: object

In [41]:
tips_df.loc[3:5]

   total_bill   tip     sex smoker  day    time  size  tip_percent
3       23.68  3.31    Male     No  Sun  Dinner     2        13.98
4       24.59  3.61  Female     No  Sun  Dinner     4        14.68
5       25.29  4.71    Male     No  Sun  Dinner     4        18.62

In [42]:
# tips_df.tail(6).loc[1] # error
tips_df.tail(6).loc[240:241]

     total_bill  tip     sex smoker  day    time  size  tip_percent
240       27.18  2.0  Female    Yes  Sat  Dinner     2         7.36
241       22.67  2.0    Male    Yes  Sat  Dinner     2         8.82

In [43]:
tips_df.tail(6).iloc[2:4]

     total_bill  tip     sex smoker  day    time  size  tip_percent
240       27.18  2.0  Female    Yes  Sat  Dinner     2         7.36
241       22.67  2.0    Male    Yes  Sat  Dinner     2         8.82

In [44]:
tips_df.tail(6).loc[240:241, "tip"]

240    2.0
241    2.0
Name: tip, dtype: float64

In [45]:
tips_fil_df = tips_df.tail(6).loc[240:241]
tips_fil_df[["tip", "size"]]

     tip  size
240  2.0     2
241  2.0     2

In [46]:
tips_df.tail(6).loc[240:241, ["tip", "size"]]

     tip  size
240  2.0     2
241  2.0     2

In [47]:
tips_df.tail(6).loc[240:241, "tip":"size"]

     tip     sex smoker  day    time  size
240  2.0  Female    Yes  Sat  Dinner     2
241  2.0    Male    Yes  Sat  Dinner     2

In [48]:
tips_df.tail(6).loc[240:241, "tip"]  # A column
tips_df.tail(6).loc[240:241, ["tip", "size"]]  # Multiple columns
tips_df.tail(6).loc[240:241, "tip":"size"]  # Range of columns

     tip     sex smoker  day    time  size
240  2.0  Female    Yes  Sat  Dinner     2
241  2.0    Male    Yes  Sat  Dinner     2

In [49]:
tips_df.tail(6).iloc[2:4]

     total_bill  tip     sex smoker  day    time  size  tip_percent
240       27.18  2.0  Female    Yes  Sat  Dinner     2         7.36
241       22.67  2.0    Male    Yes  Sat  Dinner     2         8.82

In [50]:
tips_df.tail(6).iloc[2:4, 1]  # A column
tips_df.tail(6).iloc[2:4, [1, 6]]  # Multiple columns
tips_df.tail(6).iloc[2:4, 1:7]  # Range of columns

     tip     sex smoker  day    time  size
240  2.0  Female    Yes  Sat  Dinner     2
241  2.0    Male    Yes  Sat  Dinner     2

In [51]:
# All rows but only columns from tip to day

tips_df[
    [
        "tip",
        "sex",
        "smoker",
        "day",
    ]
]
tips_df.iloc[:, 1:5]
tips_df.loc[:, "tip":"day"]  # ✅

      tip     sex smoker   day
0    1.01  Female     No   Sun
1    1.66    Male     No   Sun
2    3.50    Male     No   Sun
3    3.31    Male     No   Sun
4    3.61  Female     No   Sun
..    ...     ...    ...   ...
239  5.92    Male     No   Sat
240  2.00  Female    Yes   Sat
241  2.00    Male    Yes   Sat
242  1.75    Male     No   Sat
243  3.00  Female     No  Thur

[244 rows x 4 columns]

## Task 1
Retrieve and list the entries, sorting them from highest to lowest by tip_percent, excluding the first five results, specifically for weekends (Saturday and Sunday).

In [52]:
tips_df[(tips_df["day"] == "Sat") | (tips_df["day"] == "Sun")].sort_values(
    by="tip_percent", ascending=False
).iloc[5:]

     total_bill   tip     sex smoker  day    time  size  tip_percent
109       14.31  4.00  Female    Yes  Sat  Dinner     2        27.95
51        10.29  2.60  Female     No  Sun  Dinner     2        25.27
181       23.33  5.65    Male    Yes  Sun  Dinner     2        24.22
185       20.69  5.00    Male     No  Sun  Dinner     5        24.17
174       16.82  4.00    Male    Yes  Sun  Dinner     2        23.78
..          ...   ...     ...    ...  ...     ...   ...          ...
187       30.46  2.00    Male    Yes  Sun  Dinner     5         6.57
0         16.99  1.01  Female     No  Sun  Dinner     2         5.94
57        26.41  1.50  Female     No  Sat  Dinner     2         5.68
102       44.30  2.50  Female    Yes  Sat  Dinner     3         5.64
237       32.83  1.17    Male    Yes  Sat  Dinner     2         3.56

[158 rows x 8 columns]

## Task 2
 
Retrieve entries for Thursday lunch with party sizes greater than 3, sort them by tip (descending), Retrieve only 2nd & 3rd rank